package_delivery/app/controllers/fa_q_controller.rb

  def manager_faq
    @faqmainlist = FaQMainList.all
---
SELECT "fa_q_main_lists".* FROM "fa_q_main_lists"

  def customer_faq
    @faqmainlist = FaQMainList.all
    @faqsublist = FaQSubList.all
---
SELECT "fa_q_main_lists".* FROM "fa_q_main_lists"
SELECT "fa_q_sub_lists".* FROM "fa_q_sub_lists"