package_delivery/app/controllers/fa_q_sub_lists_controller.rb

  def index
     @faqmainlist = FaQMainList.all
---
SELECT "fa_q_main_lists".* FROM "fa_q_main_lists"

  def create
    @sublist= FaQSubList.new(sublist_params)
    if @sublist.save
---
INSERT INTO "fa_q_sub_lists" ("SubFaqQuestion", "SubFaqAnswer", "FaqMainLstId", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["SubFaqQuestion", "General Question 4"], ["SubFaqAnswer", "General Answer 4"], ["FaqMainLstId", 1], ["created_at", "2016-09-20 00:43:15.824726"], ["updated_at", "2016-09-20 00:43:15.824726"]]

  def show
    @faqmainlists = FaQMainList.all
    @faqsublists = FaQSubList.all
    @sublist = FaQSubList.find(params[:id])
---
SELECT "fa_q_main_lists".* FROM "fa_q_main_lists"
SELECT "fa_q_sub_lists".* FROM "fa_q_sub_lists"
SELECT  "fa_q_sub_lists".* FROM "fa_q_sub_lists" WHERE "fa_q_sub_lists"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @sublist = FaQSubList.find(params[:id])
---
SELECT  "fa_q_sub_lists".* FROM "fa_q_sub_lists" WHERE "fa_q_sub_lists"."id" = $1 LIMIT 1  [["id", 3]]

  def update
   @sublist =  FaQSubList.find(params[:id])
   if @sublist.update(sublist_params)
---
SELECT  "fa_q_sub_lists".* FROM "fa_q_sub_lists" WHERE "fa_q_sub_lists"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "fa_q_sub_lists" SET "SubFaqQuestion" = $1, "SubFaqAnswer" = $2, "updated_at" = $3 WHERE "fa_q_sub_lists"."id" = $4  [["SubFaqQuestion", "General Question 1"], ["SubFaqAnswer", "General Answer 1"], ["updated_at", "2016-09-20 06:14:41.092909"], ["id", 3]]

  def destroy
    @sublist = FaQSubList.find(params[:id])
	  @sublist.destroy
---
SELECT  "fa_q_sub_lists".* FROM "fa_q_sub_lists" WHERE "fa_q_sub_lists"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "fa_q_sub_lists" WHERE "fa_q_sub_lists"."id" = $1  [["id", 2]]