package_delivery/app/controllers/news_controller.rb

  def CustomerNews
    @news= News.all
---
SELECT "news".* FROM "news"

  def show
    @news = News.all
---
SELECT "news".* FROM "news"

  def destroy
    @new = News.find(params[:id])
	  @new.destroy
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "news" WHERE "news"."id" = $1  [["id", 1]]

  def edit
    @new = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 2]]

  def update
  @new = News.find(params[:id])
   if @new.update(new_params)
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "news" SET "content" = $1, "updated_at" = $2 WHERE "news"."id" = $3  [["content", "This is My first news. \r\n\r\nI want to try it is correct or not."], ["updated_at", "2016-10-03 08:40:17.354431"], ["id", 2]]

  def create
     @new= News.new(new_params)
    if @new.save
---
INSERT INTO "news" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"