package_delivery/app/controllers/pickups_controller.rb

  def index
    @pickups = Pickup.all
---
SELECT "pickups".* FROM "pickups"

  def create
    @pickup = Pickup.new(picksudos)

    respond_to do |format|
      if @pickup.save
---
INSERT INTO "pickups" ("name", "company", "address", "city", "state", "zip", "country", "number", "shipment_amount", "weight", "location_type", "package_location", "instructions", "pickup_date", "pickup_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

  def destroy
    @pickup.destroy
---
DELETE FROM "pickups" WHERE "pickups"."id" = $1  [["id", 3]]

    def set_pickup
      @pickup = Pickup.find(params[:id])
---
SELECT  "pickups".* FROM "pickups" WHERE "pickups"."id" = $1 LIMIT 1  [["id", 3]]