package_delivery/app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
  def index
    @quotes = Quote.all

INSERT INTO "quotes" ("package_type", "measurement", "wcategory", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["package_type", "Box"], ["measurement", ""], ["wcategory", ""], ["created_at", "2016-10-04 03:54:40.416775"], ["updated_at", "2016-10-04 03:54:40.416775"]]
---
  def create
    @quote = Quote.new(quote_params)

    respond_to do |format|
      if @quote.save

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_quote
      @quote = Quote.find(params[:id])