package_delivery/app/controllers/testimonies_controller.rb

SELECT "testimonies".* FROM "testimonies"
---
    def index
	@testimonies = Testimony.all

SELECT  "testimonies".* FROM "testimonies" WHERE "testimonies"."id" = $1 LIMIT 1  [["id", 1]]
---
    def edit
    @testimony = Testimony.find(params[:id])

INSERT INTO "testimonies" ("name", "text", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "tangasdf"], ["text", "Hello World"], ["rating", "2.0"], ["created_at", "2016-09-19 06:30:15.726059"], ["updated_at", "2016-09-19 06:30:15.726059"]]
---
    def create
        @testimony = Testimony.new(testimony_params)

	if @testimony.save

SELECT  "testimonies".* FROM "testimonies" WHERE "testimonies"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "testimonies" SET "text" = $1, "updated_at" = $2 WHERE "testimonies"."id" = $3  [["text", "Hello Worlda"], ["updated_at", "2016-09-20 05:15:37.318027"], ["id", 1]]
---
    def update
    	@testimony = Testimony.find(params[:id])

		 if @testimony.update(testimony_params)