package_delivery/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @employees = User.where(:identity => "driver")
    @pendingrequest = Pickup.where( "(pickupscondition ='Pending') or pickupscondition ='pending'")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."identity" = $1  [["identity", "driver"]]
SELECT "pickups".* FROM "pickups" WHERE ((pickupscondition ='Pending') or pickupscondition ='pending')

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "identity", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"